app/views/users/show.html.erb

					<td>
					    <div class="comment-count"><%= book.book_comments.count %>件コメント</div>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 2]]