app/views/books/index.html.erb

					  <li>
					    <%= link_to "#{book.book_comments.count} コメン", book_path(book.id) %>
---
SELECT "books".* FROM "books"