app/controllers/books_controller.rb

  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall
---
SELECT "books".* FROM "books"

  def create
  	@newbook = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @newbook.user_id = current_user.id
    @user = current_user
  	if @newbook.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@newbook.id), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "wofut"], ["body", "znznfyi24kxszensylh4"], ["user_id", 2], ["created_at", "2020-04-04 06:00:16.091066"], ["updated_at", "2020-04-04 06:00:16.091066"]]
SELECT "books".* FROM "books"

  def update
  	@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]