app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all #一覧表示するためにUserモデルのデータを全て変数に入れて取り出す。

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
  	@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
  	@user = User.find(params[:id])